# Найти сумму чисел списка стоящих на нечетной позиции

n = [1, 4, 9, 10, 12, 5, 7, 0]
n = [n[i] for i in range(len(n)) if i % 2 != 0]
print(sum(n)) 